{"pageProps":{"data":{"page":"This Privacy Policy is applicable for any one involves with the registering and course engagement at Dream Big Institute Online Course Educational center.\n\n### Availability of Website\n\nIn order to buy any course or become a member of our center, customers/ learners must first register with a personal account providing the following information:\n\n1.  Member recognizes that the traffic of data through the Internet may cause delays\n    during the download of information from the website and accordingly, it shall not hold the Company liable for delays that are ordinary in the course of Internet use.\n2.  Member further acknowledges and accepts that the website will not be available on a continual twenty-four hour basis due to such delays, or delays caused by the Company’s upgrading, modification, or standard maintenance of the website.\n\n### Intellectual Property Rights\n\n1.  The online course is owned by the Company and is protected by American and international copyright, trademark, patent, trade secret and other intellectual property or proprietary rights laws.\n\n2.  No right, title or interest in or to the online course or any portion thereof, is transferred to any Member, and all rights not expressly granted herein, are reserved by the Company.\n\n3.  The Company name, the Company logo, and all related names, logos, product and service names, designs\n    and slogans, are trademarks of the Company. Member may not use such marks\n    without the prior written permission of the Company.\n\n### Company Obligations\n\nThe Company will use commercially reasonable efforts to enable the online course to be accessible, except for scheduled maintenance and required repairs, and except for any interruption due to causes beyond the reasonable control of, or not reasonably foreseeable by the Company.\n\n### Governing Law and Venue\n\n1.  These Terms of Service are construed and governed by the laws of the United States of America.\n2.  If any of the provisions, either in whole or in part, of the contract is or becomes invalid or unenforceable, this shall not serve to invalidate the remaining provisions thereof.\n\n**Effective Date: 20/05/2024**\n","recentCourses":[{"title":"Software Training","thumbnail":{"src":"/images/courses/370/course-1.jpg"},"price":50,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-01"},{"title":"Spoken English","thumbnail":{"src":"/images/courses/370/course-2.jpg"},"price":0,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-02"},{"title":"JAC Board(Class 8 to 10)-Maths and Science","thumbnail":{"src":"/images/courses/370/course-3.jpg"},"price":55,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-03"},{"title":"CBSE Board(Class 8 to 10)-Maths and Science","thumbnail":{"src":"/images/courses/370/course-4.jpg"},"price":85,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-04"}]},"layout":{"headerShadow":true,"headerFluid":false,"footerMode":"light"}},"__N_SSG":true}