{"pageProps":{"data":{"page":"### Definitions of basic terms, rights and restriction:\n\n#### Basic terms\n\nThese Terms of Service for Dream Big Institute Online Course Educational Center constitute a binding contract between you (“Member” or “Customer” or “You”) and ThemeMove company, a corporation registered in California, USA (“Company”), regarding the terms under which the Company will provide You with access to online courses (or parts thereof) purchased by You.\n\n#### Rights & restrictions\n\n1. Members must be at least 18 years of age.\n2. Members are granted a time-limited, non-exclusive, revocable, nontransferable, and non-sublicenseable right to access that portion of the online course corresponding to the purchase.\n3. The portion of the online course corresponding to the purchase will be available to the Member as long as the course is maintained by the Company, which will be a minimum of one year after Member’ purchase.\n4. The videos in the course are provided as a video stream and are not downloadable.\n5. By agreeing to grant such access, the Company does not obligate itself to maintain the course, or to maintain it in its present form.\n","recentCourses":[{"title":"Software Training","thumbnail":{"src":"/images/courses/370/course-1.jpg"},"price":50,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-01"},{"title":"Spoken English","thumbnail":{"src":"/images/courses/370/course-2.jpg"},"price":0,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-02"},{"title":"JAC Board(Class 8 to 10)-Maths and Science","thumbnail":{"src":"/images/courses/370/course-3.jpg"},"price":55,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-03"},{"title":"CBSE Board(Class 8 to 10)-Maths and Science","thumbnail":{"src":"/images/courses/370/course-4.jpg"},"price":85,"currency":"$","published_at":"2024-05-21T00:00:00.000Z","path":"/courses/course-04"}]},"layout":{"headerShadow":true,"headerFluid":false,"footerMode":"light"}},"__N_SSG":true}