{
    "id": 2,
    "title": "Spoken English",
    "thumbnail": {
        "src": "/images/courses/370/course-2.jpg"
    },
    "published_at": "2024-05-21T00:00:00.000Z",
    "category": "Interview Preparation",
    "price": 0,
    "currency": "$",
    "language": "english",
    "instructor": 2,
    "duration": "45 hours",
    "total_lectures": 20,
    "total_students": 50,
    "membership": ["diamond"],
    "isPopular": true,
    "excerpt": "Learn how to speak confidently",
    "curriculum": [
        "chapter-101",
        "chapter-102",
        "chapter-103",
        "chapter-104",
        "chapter-105"
    ],
    "reviews": {
        "average": 4.5,
        "count": 2,
        "rating_details": {
            "5": 1,
            "4": 1,
            "3": 0,
            "2": 0,
            "1": 0
        },
        "items": [
            {
                "id": 1,
                "user": {
                    "name": "Edna Watson",
                    "avatar": {
                        "src": "/images/review-author/author1.jpeg"
                    }
                },
                "rating": 5.0,
                "title": "Cover all my needs",
                "review": "The course identify things we want to change and then figure out the things that need to be done to create the desired outcome. The course helped me in clearly define problems and generate a wider variety of quality solutions. Support more structures analysis of options leading to better decisions."
            },
            {
                "id": 2,
                "user": {
                    "name": "Owen Christ",
                    "avatar": {
                        "src": "/images/review-author/author2.jpeg"
                    }
                },
                "rating": 4.5,
                "title": "Engaging & Fun",
                "review": "This is the third course I attend from you, and I absolutely loved all of them. Especially this one on leadership. Your method of explaining the concepts, fun, engaging and with real-world quizples, is excellent. This course will help me a lot in my job, my career, and life in general, and I thank you for that. Thank you for improving the lives of many people with engaging and in-depth courses."
            }
        ]
    },
    "description": [
        {
            "id": 1,
            "type": "text",
            "content": "Speaking English is highly valuable in today's globalized world, English is the most widely spoken language worldwide, serving as a common medium for people from different linguistic backgrounds to communicate"
        },
        {
            "id": 2,
            "type": "text",
            "content": "English proficiency is a highly sought-after skill in the global job market, opening doors to job opportunities in multinational companies."
        },
        {
            "id": 3,
            "type": "iframe",
            "content": {
                "src": "https://www.youtube.com/embed/m-X1ExlQ9uE?feature=oembed",
                "alt": "Drive Digital Transformation With Platform Strategies | Info-Tech Analyst Perspective"
            }
        },
        {
            "id": 4,
            "type": "text",
            "content": "Companies often use English to market their products and services to a global audience, making it essential for business expansion and success."
        },
        {
            "id": 5,
            "type": "text",
            "content": "The tech industry predominantly operates in English, with programming languages, software documentation, and tech forums often using English as the primary language."
        },
        {
            "id": 6,
            "type": "text",
            "content": "That’s what you’ll learn in this course."
        },
        {
            "id": 7,
            "type": "heading",
            "content": "A Short Description"
        },
        {
            "id": 8,
            "type": "text",
            "content": "English is widely used on social media platforms, allowing individuals to connect with a global audience and participate in international conversations."
        },
        {
            "id": 9,
            "type": "text",
            "content": "Speaking English is a critical skill that facilitates global communication, access to education, career opportunities, and cultural exchange!"
        },
        {
            "id": 10,
            "type": "text",
            "content": "As the world becomes increasingly interconnected, the importance of English proficiency continues to grow, making it an essential tool for personal and professional development."
        },
        {
            "id": 11,
            "type": "text",
            "content": "Enroll in this course to find out."
        }
    ]
}
